{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-MethodName",
    "2": "I-MethodName",
    "3": "B-HyperparameterName",
    "4": "I-HyperparameterName",
    "5": "B-HyperparameterValue",
    "6": "I-HyperparameterValue",
    "7": "B-MetricName",
    "8": "I-MetricName",
    "9": "B-MetricValue",
    "10": "I-MetricValue",
    "11": "B-TaskName",
    "12": "I-TaskName",
    "13": "B-DatasetName",
    "14": "I-DatasetName"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DatasetName": 13,
    "B-HyperparameterName": 3,
    "B-HyperparameterValue": 5,
    "B-MethodName": 1,
    "B-MetricName": 7,
    "B-MetricValue": 9,
    "B-TaskName": 11,
    "I-DatasetName": 14,
    "I-HyperparameterName": 4,
    "I-HyperparameterValue": 6,
    "I-MethodName": 2,
    "I-MetricName": 8,
    "I-MetricValue": 10,
    "I-TaskName": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
